Autodesk.Revit.DB.Mechanical.SpaceTagTypeSet
A set that contains space tag types.

Autodesk.Revit.DB.Mechanical.SpaceTagTypeSet.Insert(Autodesk.Revit.DB.Mechanical.SpaceTagType)
System.Int32
Insert the specified space tag type into the set.
item: The space tag type to be inserted into the set.
Returns: Returns whether the space tag type was inserted into the set.

Autodesk.Revit.DB.Mechanical.SpaceTagTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Mechanical.SpaceTagTypeSet.ReverseIterator
Autodesk.Revit.DB.Mechanical.SpaceTagTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Mechanical.SpaceTagTypeSet.ForwardIterator
Autodesk.Revit.DB.Mechanical.SpaceTagTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Mechanical.SpaceTagTypeSet.Erase(Autodesk.Revit.DB.Mechanical.SpaceTagType)
System.Int32
Removes a specified space tag type from the set.
item: The space tag type to be erased.
Returns: The number of space tag types that were erased from the set.

Autodesk.Revit.DB.Mechanical.SpaceTagTypeSet.Contains(Autodesk.Revit.DB.Mechanical.SpaceTagType)
System.Boolean
Tests for the existence of a space tag type within the set.
item: The space tag type to be searched for.
Returns: The Contains method returns True if the space tag type is within the set, otherwise False.

Autodesk.Revit.DB.Mechanical.SpaceTagTypeSet.Clear
void
Removes every space tag type from the set, rendering it empty.

Autodesk.Revit.DB.Mechanical.SpaceTagTypeSet.Size
System.Int32
get
Returns the number of space tag types that are in the set.

Autodesk.Revit.DB.Mechanical.SpaceTagTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.